manuscript-draft/manuscript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-07-25 Tue 18:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kevin Nolan MMT thesis 2017</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kevin Nolan Kevin Nolan" />
<meta name="description" content="Sketching sounds in the modern web browser"
 />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Kevin Nolan MMT thesis 2017</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9f4cd84">1. Introduction</a>
<ul>
<li><a href="#orgf46439f">1.1. Motivation</a></li>
<li><a href="#orgf4c2a66">1.2. Project goals</a></li>
<li><a href="#orgc631091">1.3. Structure of thesis</a></li>
</ul>
</li>
<li><a href="#orga3a5d69">2. Background</a>
<ul>
<li><a href="#org1f32115">2.1. DAW analog metaphors</a></li>
<li><a href="#orgddf0c4e">2.2. Legacy systems</a></li>
<li><a href="#orga98acba">2.3. Golan Levin et al</a></li>
</ul>
</li>
<li><a href="#org4c7db42">3. Similar work</a></li>
<li><a href="#orgafba71a">4. <span class="todo TODO">TODO</span> My approach <code>[0/2]</code></a>
<ul>
<li><a href="#orgdbc3a55">4.1. Adding allowances for stylus</a></li>
<li><a href="#orgb4b83be">4.2. Key specifications</a></li>
<li><a href="#org54eb954">4.3. Paper.js</a></li>
<li><a href="#org6a2082d">4.4. Tone.js</a></li>
</ul>
</li>
<li><a href="#org11b1bc0">5. Execution</a>
<ul>
<li><a href="#org33b6970">5.1. Early prototypes</a>
<ul>
<li><a href="#org54b4fe1">5.1.1. Melodypainter</a></li>
<li><a href="#org3098138">5.1.2. Sonicsketch - shape recognition</a></li>
</ul>
</li>
<li><a href="#orgb0aadd1">5.2. Actual build out</a>
<ul>
<li><a href="#orgd20de97">5.2.1. Advantages of the react.js model of UI programming</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge039078">6. Evaluation</a></li>
<li><a href="#org05c7c82">7. Conclusion</a></li>
<li><a href="#org026be05">8. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9f4cd84" class="outline-2">
<h2 id="org9f4cd84"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgf46439f" class="outline-3">
<h3 id="orgf46439f"><span class="section-number-3">1.1</span> Motivation</h3>
</div>
<div id="outline-container-orgf4c2a66" class="outline-3">
<h3 id="orgf4c2a66"><span class="section-number-3">1.2</span> Project goals</h3>
</div>
<div id="outline-container-orgc631091" class="outline-3">
<h3 id="orgc631091"><span class="section-number-3">1.3</span> Structure of thesis</h3>
</div>
</div>

<div id="outline-container-orga3a5d69" class="outline-2">
<h2 id="orga3a5d69"><span class="section-number-2">2</span> Background</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org1f32115" class="outline-3">
<h3 id="org1f32115"><span class="section-number-3">2.1</span> DAW analog metaphors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
One of the primary tools used by electronic musicians today for the production
of music is DAW and it's inherent metaphors based on analog system still reign
supreme in the field <a class='org-ref-reference' href="#bell_journal_2015">bell_journal_2015</a>. The familiar concepts of analog
tape machines and mixers benefit the novice user by offering a network of
familiar and tangible real world metaphors in which to carry out their creative
work. However, as well as the benefits that these types of metaphors bring, they
also impose some limitations and bring about certain biases. Musical ideas that
are difficult to realise can be left unexplored.
</p>

<p>
A particular criticism of the DAW is the difficulty in maintaining and managing
the editing of complex automation information. Automation is the term given to
the continuous altering of aspects of the sound and is usually represented in
lanes separate to the primary note pitch information. It may be recorded in or
drawn in by the producer. Difficulties can arise, when multiple subtly
interacting lines of automation, such as pitch bends and filter changes are
being manipulated. William Coleman gives a particularly clear example of this
and outlines the difficulty of representing "portamento time", the time it takes
a note to slide from one to the next. The visual results can be jarring,
unintuitive and not reflective of the audio results.
</p>

<div class="caution">
<p>
Duignan (2008) describes a similar problem in his study that monitored
professional producers working in DAW environments
<a class='org-ref-reference' href="#duignan_computer_2008">duignan_computer_2008</a>. The particular problem identified by
Duignan was that of processing one off effects for single musical events. A
number of convoluted processes were observed, including bouncing the affected
portion to audio, duplicating the track, setting up a particular auxiliary for
the effect and controlling the effect with automation. In these cases, the
hierarchy imposed by the DAW gets in the way, where it could be modeled quite
elegantly in a more open program such as Max Msp. This, unfortunately, raises
the issue of drifting into the area of analytic thinking and away from creative
thinking, a combination that John Cage advises against: "Don't try to create and
analyse at the same time. They're different processes." <a class='org-ref-reference' href="#popova_10_2012">popova_10_2012</a> The
need to explore alternative metaphors is clear. A description of a promising
alternative metaphor, that of drawing/sketching will now be discussed.
</p>

</div>
</div>
</div>

<div id="outline-container-orgddf0c4e" class="outline-3">
<h3 id="orgddf0c4e"><span class="section-number-3">2.2</span> Legacy systems</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Oramics</li>
<li>UPIC</li>
</ul>
</div>
</div>

<div id="outline-container-orga98acba" class="outline-3">
<h3 id="orga98acba"><span class="section-number-3">2.3</span> Golan Levin et al</h3>
</div>
</div>


<div id="outline-container-org4c7db42" class="outline-2">
<h2 id="org4c7db42"><span class="section-number-2">3</span> Similar work</h2>
</div>

<div id="outline-container-orgafba71a" class="outline-2">
<h2 id="orgafba71a"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> My approach <code>[0/2]</code></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Come up with a title</li>
<li class="off"><code>[&#xa0;]</code> Other stuff</li>
</ul>
</div>

<div id="outline-container-orgdbc3a55" class="outline-3">
<h3 id="orgdbc3a55"><span class="section-number-3">4.1</span> Adding allowances for stylus</h3>
</div>
<div id="outline-container-orgb4b83be" class="outline-3">
<h3 id="orgb4b83be"><span class="section-number-3">4.2</span> Key specifications</h3>
</div>
<div id="outline-container-org54eb954" class="outline-3">
<h3 id="org54eb954"><span class="section-number-3">4.3</span> Paper.js</h3>
</div>
<div id="outline-container-org6a2082d" class="outline-3">
<h3 id="org6a2082d"><span class="section-number-3">4.4</span> Tone.js</h3>
</div>
</div>
<div id="outline-container-org11b1bc0" class="outline-2">
<h2 id="org11b1bc0"><span class="section-number-2">5</span> Execution</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org33b6970" class="outline-3">
<h3 id="org33b6970"><span class="section-number-3">5.1</span> Early prototypes</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-org54b4fe1" class="outline-4">
<h4 id="org54b4fe1"><span class="section-number-4">5.1.1</span> Melodypainter</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Thus far, some early test prototypes to establish possible directions for the
application have been built. A Max Msp patch was created which allows the user
to draw freehand lines, which are converted into break point function data and
used as to generate a melodic profile in Bach. This is further processed into a
pentatonic scale. Once input the system plays the resulting melody back. A
notable flaw of the system was that it required users to draw shapes in a
generally horizontal fashion for the data to be of use and to create a strong
relationship between the visuals and the generated music.
</p>
</div>
</div>

<div id="outline-container-org3098138" class="outline-4">
<h4 id="org3098138"><span class="section-number-4">5.1.2</span> Sonicsketch - shape recognition</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
A separate application was created in Processing which allowed users to draw
shapes, using either mouse or ideally, pen input and have a sound that is
associated with each shape played back. As the sound of each shape plays back,
it is lit up using animation, creating a strong connection between the shape and
it's resulting sound. The application used the "gesture variation follower"
system <a class='org-ref-reference' href="#caramiaux_adaptive_2015">caramiaux_adaptive_2015</a>, which while promising in principle, didn't
have a high rate of accuracy in recognizing the shapes. It is for this reason
that Microsoft's ink api is now being used for further prototyping.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb0aadd1" class="outline-3">
<h3 id="orgb0aadd1"><span class="section-number-3">5.2</span> Actual build out</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-orgd20de97" class="outline-4">
<h4 id="orgd20de97"><span class="section-number-4">5.2.1</span> Advantages of the react.js model of UI programming</h4>
</div>
</div>
</div>

<div id="outline-container-orge039078" class="outline-2">
<h2 id="orge039078"><span class="section-number-2">6</span> Evaluation</h2>
</div>

<div id="outline-container-org05c7c82" class="outline-2">
<h2 id="org05c7c82"><span class="section-number-2">7</span> Conclusion</h2>
</div>

<div id="outline-container-org026be05" class="outline-2">
<h2 id="org026be05"><span class="section-number-2">8</span> References</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kevin Nolan Kevin Nolan</p>
<p class="date">Created: 2017-07-25 Tue 18:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
